

-------------------------------------------- 1 -----------------------------------------------------

    #include <iostream>
    int main()
    {
    cout<<"Aa Bb Cc De Ee Ff Gg Hh li Jj Kk Ll Mm Nn Oo Pp Qq Rr Ss Tt Uu Vv Ww Xx YY ZZ ";
    return 0;
    }

-------------------------------------------- 2 -----------------------------------------------------

    #include <iostream>
    int main()
    {
    cout<<"*****\n";
    cout<<"*    *\n";
    cout<<"*    *\n";
    cout<<"*****\n";
    cout<<"*    *\n";
    cout<<"*    *\n";
    cout<<"*****\n";
    return 0;
    }


-------------------------------------------- 3 -----------------------------------------------------

    #include <iostream>
    int main()
    {
    cout<<"*****\n";
    cout<<"*    *\n";
    cout<<"*     *\n";
    cout<<"*     *\n";
    cout<<"*     *\n";
    cout<<"*     *\n";
    cout<<"*****\n";
    return 0;
    }


-------------------------------------------- 4 -----------------------------------------------------

    #include <iostream>
    int main()
    {
    cout << " Nimaaa \n ";    باعث می شود که پس از چاپ رشته، کنترل به ابتدای سطر بعد منتقل شود \n
    cout << "\t";             خروجی را به اندازه یک تب به جلو میبرد \t
    cout << "\v";             خروچی را به ابتدای ۸ سطر بعد میبرد \v
    cout << " nima \b ";      کارکتر قبل خودش را حذف میکند  \b
    cout << " \" ";           را چاپ میکند "
    cout << " \\ ";           را چاپ میکند \
    cout << " \? ";           را چاپ میکند ?
    cout << " \' ";           را چاپ میکند '
    cout << "a\r" << "b";     کنترل خروجی به ابتدای سطر جاری بر میگردد
    cout << " \a ";           بوق سیستم را به صدا در میاورد
    return 0;
    }

-------------------------------------------- 5 -----------------------------------------------------

    #include <iostream>
    int main()
    {
     cout<<60+7<<" "<<60-7<<" "<<60*7<<" "<<60/7<<" "<<60%7;
     return 0;
    }

-------------------------------------------- 6 -----------------------------------------------------

    #include <iostream>
    int main()
    {
      int m,n;
      cout <<" please enter two number: ";
      cin >> m>>n;
      cout <<m+n<<" "<<m-n<<" "<<m*n<<" "<<m/n<<" "<<m%n ;
      return 0;
    }


------------------------------------ by Nima Dorostkar -----------------------------------------------
